In [1]:
#Name: Daniel Nametz, Partner: Emily Antico, RH Database Lab3

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///lab3.db3

In [4]:
%%sql sqlite://
    SELECT name
    FROM sqlite_master
    WHERE type='table' AND name NOT LIKE 'sqlite_%';

Done.

[('students',), ('courses',), ('scores',), ('teachers',)]

In [5]:
%%sql 
--In the score table, find the student number that has all the grades in between 90 and 70.--
SELECT sno
FROM scores 
EXCEPT 
    SELECT sno
    FROM scores
    WHERE grade > 90 or grade < 70

 * sqlite:///lab3.db3
Done.

[('105',), ('108',)]

In [6]:
%%sql
--For all the courses that took by class 15033, calculate the average grade. --

--find sno in class 15033 --

--check course that those sno took --

--then get grades and calculate average grade for each course. --

SELECT AVG(grade), cno
FROM scores s, students t
WHERE s.sno = t.sno and t.class = 15033 
GROUP BY s.cno

 * sqlite:///lab3.db3
Done.

[(77.66666666666667, '3-105'), (79.0, '6-106'), (83.0, '6-166')]

In [7]:
%%sql
--Find the class number that has at least two male students. --

SELECT class, COUNT (sgender)
FROM students
WHERE sgender='M'
GROUP By class
HAVING COUNT (sgender)>=2

 * sqlite:///lab3.db3
Done.

[('15031', 2), ('15033', 2)]

In [8]:
%%sql
--Find the teachers name in CS and EE department, where they have different title. Return both name and title--

--find name and title-- 
--nested query to find where they have different titles--

SELECT tname, title
FROM teachers
EXCEPT
    SELECT tname, title
    FROM teachers
    WHERE department != 'EE' or department != 'CS'
    GROUP BY title
    HAVING COUNT(title) > 1

    
/*
This returns the distinct titles from the departments of CS and EE
Alice doesnt show up because she shares a title with emma
*/

 * sqlite:///lab3.db3
Done.

[('Dan', 'AP'), ('Emma', 'TA'), ('Frank', 'LE')]

In [9]:
%%sql
--Find the students, who took the course number "3-105" and have earned a grade, at least, higher than the students who took "3-245" course. Return the results in a descending order of grade.--

SELECT sname
FROM students s, scores c
WHERE s.sno=c.sno and c.cno = "3-105" and c.grade>(
    SELECT MAX(grade)
    FROM scores
    WHERE cno = "3-245"
)
ORDER BY c.grade DESC

 * sqlite:///lab3.db3
Done.

[('Quincy',), ('Lily',), ('Gary',)]

In [10]:
%%sql
--Find the students, who took more than 1 course, and return the students names that is not the one with highest grade --

SELECT sname
FROM students s, scores c
EXCEPT
    SELECT MAX(sname)
    FROM students
    WHERE(
        SELECT MAX(grade)
        FROM scores
        EXCEPT
            -- this excludes anyone with 1 or less classes -- 
            SELECT COUNT(sno) AS Frequency 
            FROM scores
            GROUP BY sno
            HAVING COUNT(sno) <= 1
        )
    

-- should return every name except quincy--

 * sqlite:///lab3.db3
Done.

[('Alex',), ('Eva',), ('Gary',), ('Lily',), ('Peter',)]

In [11]:
%%sql
--For each course, find the students who earned a grade less than the average grade of this course --


SELECT sno, cno, grade
FROM scores c
WHERE grade < (
    SELECT AVG(grade)
    FROM scores
    GROUP BY cno
)

 * sqlite:///lab3.db3
Done.

[('105', '3-245', 75),
 ('109', '3-245', 68),
 ('109', '3-105', 76),
 ('101', '3-105', 64),
 ('108', '3-105', 78),
 ('107', '6-106', 79),
 ('108', '6-166', 81)]

In [12]:
%%sql
SELECT *
FROM students

 * sqlite:///lab3.db3
Done.

[('108', 'Peter', 'M', '1997-09-01', '15033'),
 ('105', 'Gary', 'M', '1995-10-02', '15031'),
 ('107', 'Lily', 'F', '1996-01-23', '15033'),
 ('101', 'Alex', 'M', '1996-02-20', '15033'),
 ('109', 'Eva', 'F', '1995-02-10', '15031'),
 ('103', 'Quincy', 'M', '1994-06-03', '15031')]

In [13]:
%%sql
SELECT *
FROM scores

 * sqlite:///lab3.db3
Done.

[('103', '3-245', 86),
 ('105', '3-245', 75),
 ('109', '3-245', 68),
 ('103', '3-105', 92),
 ('105', '3-105', 88),
 ('109', '3-105', 76),
 ('101', '3-105', 64),
 ('107', '3-105', 91),
 ('108', '3-105', 78),
 ('101', '6-166', 85),
 ('107', '6-106', 79),
 ('108', '6-166', 81)]

In [14]:
%%sql
SELECT *
FROM teachers

 * sqlite:///lab3.db3
Done.

[('804', 'Dan', 'M', '1958-12-02', 'AP', 'CS'),
 ('856', 'Frank', 'M', '1969-03-12', 'LE', 'EE'),
 ('825', 'Alice', 'F', '1972-05-05', 'TA', 'CS'),
 ('831', 'Emma', 'F', '1977-08-14', 'TA', 'EE')]